import { Box, Container, Typography, useTheme } from "@mui/material";
import { VerticalTimeline } from "react-vertical-timeline-component";
import "react-vertical-timeline-component/style.min.css";
import ServicesCard from "./ServicesCard";


function Services() {
  let theme = useTheme();

  let experiences = [
    {
      title: "تطوير الويب",
      // icon: service10,
      description: `نحن متخصصون في خدمات تصميم وتطوير مواقع الويب. نقدم حلولًا مخصصة لتلبية احتياجات عملك عبر الإنترنت. سواء كنت تحتاج إلى موقع ويب تجاري، مدونة، منصة إلكترونية، أو أي نوع آخر من المواقع، نحن هنا لضمان تحقيق أهدافك الرقمية.
        نهتم بتصميم واجهات المستخدم الجذابة وسهولة الاستخدام، ونقوم بتطوير مواقع الويب باستخدام التقنيات الحديثة لضمان أداء عالي وتجربة مستخدم فعالة. نحن نفهم أهمية استجابية الموقع وتحسين محركات البحث (SEO) لزيادة رؤية موقعك.`,
    },
    {
      title: "تطبيقات الهاتف المحمول وسطح المكتب",
      // icon: service11,
      description:
        "نحن متخصصون في تطوير تطبيقات الهاتف المحمول وتطبيقات سطح المكتب. نهدف إلى تقديم حلاً شاملاً لاحتياجات عملك عبر مختلف الأنظمة والأجهزة. سواء كنت بحاجة إلى تطبيقات لأجهزة iOS و Android أو تطبيقات تعمل على أنظمة سطح المكتب مثل Windows و macOS، نحن هنا لنساعدك في تحقيق ذلك.",
    },
    {
      title: "تحسين محركات البحث",
      // icon: service4,
      description:
        "نحن نعمل على تحسين هيكلية موقعك ومحتواه، ونستخدم كلمات مفتاحية استراتيجية لضمان ظهور موقعك عندما يبحث الأشخاص عن منتجات أو خدمات تتعلق بنشاطك التجاري. نحن نقدم استشارات مخصصة وخدمات متخصصة لضمان تحقيق أهدافك في مجال تحسين محركات البحث.",
    },
    {
      title: "ادارة منصات التواصل الإجتماعي",
      // icon: service1,
      description:
        "نحن نقوم بإنشاء وإدارة محتوى جذاب على منصات مثل Facebook، Instagram، Twitter، وغيرها. نهدف إلى تفهم جمهورك وأهدافك ونقوم بتنفيذ استراتيجيات تسويقية مخصصة لزيادة التفاعل وزيادة الوعي بعلامتك التجارية. سواء كنت بحاجة إلى زيادة عدد المتابعين أو زيادة المبيعات عبر وسائل التواصل الاجتماعي، نحن هنا لمساعدتك في تحقيق أهدافك.",
    },
    {
      title: "تحليل المنافسين",
      // icon: service5,
      description:
        "نحن نقوم بجمع وتحليل البيانات المتعلقة بمنافسيك، مثل استراتيجيات التسويق والأسعار والمنتجات وردود الفعل من الزبائن. هذا يمكن أن يساعدك في اتخاذ القرارات الاستراتيجية الصائبة وتطوير استراتيجيات تسويق ومبيعات فعالة تتيح لك التفوق على المنافسين وتحقيق النجاح في سوقك.",
    },
    {
      title: "استراتيجية وخطة المحتوي",
      // icon: service3,
      description: `ستتضمن الخطة أهدافًا محددة واستراتيجيات تنفيذية لتحقيق تلك الأهداف. نحن نهتم بتقديم خطط ملائمة ومخصصة لاحتياجات عملك وميزانيتك. سوف نساعدك في تحقيق النجاح في استراتيجيتك التسويقية وزيادة رؤية علامتك التجارية ونمو أعمالك.
        نساعدك في تحديد أنواع المحتوى المناسبة، مثل المقالات، والصور، والفيديو، والمدونات، وسنقدم توجيهًا حول كيفية إنشاء وتوزيع المحتوى بطريقة تلبي احتياجات جمهورك وتعزز علامتك التجارية.
سيتضمن ذلك أيضًا تحديد التوقيت والقنوات المناسبة لنشر المحتوى، وكيفية قياس أداء المحتوى وتحسينه بناءً على البيانات والتحليل.
`,
    },
    {
      title: "إعلانات منصات التواصل",
      // icon: service2,
      description: `نحن نقدم خدمات إعلانات على منصات التواصل الاجتماعي. سواء كنت ترغب في الإعلان على Facebook، Instagram، Twitter، أو غيرها من المنصات، فإننا نملك الخبرة والمعرفة لتنفيذ حملات إعلانية ناجحة.

        نحن نقوم بإنشاء إعلانات مستهدفة تلبي احتياجات جمهورك المستهدف وتساهم في تحقيق أهدافك التسويقية. سواء كنت ترغب في زيادة الوعي بعلامتك التجارية أو زيادة المبيعات، نحن هنا لمساعدتك في تصميم وتنفيذ حملات إعلانية فعالة على منصات التواصل الاجتماعي.`,
    },
    {
      title: "إعلانات جوجل",
      // icon: service6,
      description: `نحن نقدم خدمات الإعلان على منصة جوجل بشكل مخصص لمساعدتك في الوصول إلى جمهورك المستهدف عبر الإعلانات. يمكننا إنشاء حملات إعلانية على جوجل تستهدف البحث والعرض والشبكة الاجتماعية، مما يمنحك فرصة كبيرة لزيادة رؤية علامتك التجارية وزيادة المبيعات.

        نقوم ببحث واختيار الكلمات الرئيسية الصحيحة وإعداد الإعلانات الجاذبة التي تجلب الزبائن المحتملين. نضبط حملات الإعلان لتحقيق أقصى عائد على الاستثمار ونقوم بتحليل وتتبع أداء الإعلانات لضمان تحسينها باستمرار.`,
    },
    {
      title: "تصميم الهوية البصرية",
      // icon: service9,
      description: `الهوية البصرية هي جوهر وجاهة علامتك التجارية وتمثيلها البصري. يتضمن ذلك تصميم الشعار، والألوان، والأنماط، والخطوط المستخدمة في علامتك التجارية.

        نحن نعمل معك لفهم قيم ورؤية عملك، ونقوم بتصميم هوية بصرية تعكس هذه القيم بشكل فعال ومميز. سوف نساعدك في إنشاء هوية بصرية مميزة تميزك عن المنافسين وتعزز التعرف على علامتك التجارية`,
    },
    {
      title: "تصميم الجرافيك",
      // icon: service7,
      description: `سواء كنت تبحث عن تصميم مبتكر لمشروع جديد أو تحتاج إلى تحسين تصميماتك الحالية، نحن هنا لتحقيق رؤيتك وتحويلها إلى تصاميم جذابة ومبدعة. نحن نهتم بتقديم تصاميم عالية الجودة تلبي احتياجاتك وتلفت الانتباه وتعزز رسالتك وعلامتك التجارية.

        لتلبية احتياجاتك في مجال التصميم البصري. يمكننا تصميم الجرافيك لمختلف الأغراض بما في ذلك تصميم الشعارات، والملصقات، والإعلانات، والمواد التسويقية، والتصاميم الرقمية، والمزيد.`,
    },
    {
      title: "التصوير والمونتاج",
      // icon: service8,
      description: `سواء كنت بحاجة إلى فيديو تسويقي، أو محتوى تعليمي، أو فيديو ترويجي، نحن هنا لتلبية احتياجاتك في مجال التصوير والمونتاج لضمان إنتاج محتوى فيديو عالي الجودة يلفت الانتباه وينقل رسالتك بفعالية.`,
    },
  ];

  return (
    <Box id="services" sx={{overflowX: "hidden"}}>
      <Container>
        <Typography
          variant="sectionHeadText"
          sx={{ color: theme.palette.secondary.main }}
        >
          خدماتنا
        </Typography>

        <VerticalTimeline lineColor={theme.palette.secondary.main}>
          {experiences.map((experience, index) => (
            <ServicesCard
              key={`experience-${index}`}
              experience={experience}
            />
          ))}
        </VerticalTimeline>
      </Container>
    </Box>
  );
}

export default Services;
